[
  {
    "id": 0,
    "articleTitle": "The Benefits of LED Lighting",
    "image": "images/led-bulbs.jpg",
    "author": "Energy Efficiency Journal",
    "summary": "How switching to LED bulbs can dramatically reduce energy consumption",
    "readingTime": "5 min read",
    "energySavings": "75%",
    "content": "aaaaaaaaLED lighting has revolutionized home energy efficiency. These bulbs use 75% less energy than traditional incandescent bulbs while lasting up to 25 times longer. The article explores how widespread adoption of LED technology could significantly reduce global energy consumption for lighting.",
    "featured": true
  },
  {
    "id": 1,
    "articleTitle": "Smart Thermostats: Saving Energy Automatically",
    "image": "images/smart-thermostat.jpg",
    "author": "Green Home Magazine",
    "summary": "How smart thermostats optimize heating and cooling for maximum efficiency",
    "readingTime": "7 min read",
    "energySavings": "23%",
    "content": "Smart thermostats learn your schedule and preferences to optimize your home's temperature, saving energy while keeping you comfortable. Studies show they can reduce heating and cooling costs by up to 23% annually. This article examines the technology behind these devices and their real-world impact on energy consumption.",
    "featured": true
  },
  {
    "id": 2,
    "articleTitle": "Energy Efficient Appliances: What to Look For",
    "image": "images/eco-fridge.jpg",
    "author": "Sustainable Living Press",
    "summary": "A guide to understanding ENERGY STAR ratings and appliance efficiency",
    "readingTime": "10 min read",
    "energySavings": "40%",
    "content": "Modern energy-efficient appliances like refrigerators can use 40% less energy than standard models. This comprehensive guide explains ENERGY STAR certification, what makes an appliance energy efficient, and how to calculate potential savings when replacing old appliances.",
    "featured": true
  },
  {
    "id": 3,
    "articleTitle": "Harnessing Solar Power for Everyday Devices",
    "image": "images/solar-power-bank.jpg",
    "author": "Renewable Energy Today",
    "summary": "Exploring small-scale solar solutions for personal electronics",
    "readingTime": "6 min read",
    "energySavings": "100%",
    "content": "Portable solar solutions allow us to charge devices using clean, renewable energy. This article looks at the technology behind solar power banks, their efficiency improvements in recent years, and how they can completely eliminate grid electricity use for small electronics.",
    "featured": false
  },
  {
    "id": 4,
    "articleTitle": "Water Conservation and Energy Savings",
    "image": "images/low-flow-shower.jpg",
    "author": "Eco Living Journal",
    "summary": "The connection between water usage and energy consumption",
    "readingTime": "8 min read",
    "energySavings": "50%",
    "content": "Low-flow fixtures like shower heads not only conserve water but also save the energy needed to heat that water. This piece explores the often-overlooked energy costs of water usage and how simple changes in our homes can lead to significant savings in both water and energy.",
    "featured": true
  },
  {
    "id": 5,
    "articleTitle": "Home Energy Monitoring Systems",
    "image": "images/energy-monitor.jpg",
    "author": "Tech for Sustainability",
    "summary": "How real-time energy data can help reduce consumption",
    "readingTime": "9 min read",
    "energySavings": "15-20%",
    "content": "Energy monitoring systems provide detailed insights into your home's electricity usage, helping identify waste and optimize consumption. Studies show these systems can lead to 15-20% energy savings simply by making users more aware of their consumption patterns.",
    "featured": false
  },
  {
    "id": 6,
    "articleTitle": "Zone Heating: An Efficient Alternative",
    "image": "images/space-heater.jpg",
    "author": "Energy Solutions Quarterly",
    "summary": "The benefits of heating only occupied spaces",
    "readingTime": "5 min read",
    "energySavings": "10-15%",
    "content": "Zone heating involves warming only the rooms you're using rather than the entire house. While portable heaters have limitations, when used strategically they can reduce overall heating costs by 10-15%. This article discusses best practices for safe and efficient zone heating.",
    "featured": false
  },
  {
    "id": 7,
    "articleTitle": "Window Insulation: A Low-Cost Energy Saver",
    "image": "images/window-insulation.jpg",
    "author": "Home Efficiency Digest",
    "summary": "Simple solutions for reducing heat loss through windows",
    "readingTime": "4 min read",
    "energySavings": "70%",
    "content": "Window insulation kits can reduce heat loss through windows by up to 70%, making them one of the most cost-effective energy efficiency improvements. This article compares different insulation methods and their potential impact on home energy bills.",
    "featured": true
  }
]